{
    "xdm:5": {
        "id": "5",
        "title": "How to write a Pseudo Code?",
        "content": "* استخدم اصطلاحات التسمية المناسبة. الميل البشري يتبع نهج اتباع ما نراه. إذا مر المبرمج بشفرة زائفة ، فسيكون نهجه هو نفسه ، لذلك يجب أن تكون التسمية بسيطة ومميزة.\n* استخدم أغلفة الجمل المناسبة ، مثل CamelCase للطرق ، والأحرف الكبيرة للثوابت والحالة الصغيرة للمتغيرات.\n* اشرح بالتفصيل كل ما سيحدث في الكود الفعلي. لا تجعل الشفرة الزائفة مجردة.\n* استخدم هياكل البرمجة القياسية مثل \"if-then\" و \"for\" و \"while\" و \"cases\" بالطريقة التي نستخدمها بها في البرمجة.\n* تحقق مما إذا كانت جميع أقسام الشفرة الزائفة كاملة ومحدودة وواضحة للفهم والاستيعاب.\n* لا تكتب الشفرة الزائفة بطريقة برمجية كاملة. من الضروري أن تكون سهل الفهم حتى بالنسبة للشخص العادي أو العميل ، وبالتالي لا تدمج الكثير من المصطلحات الفنية.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-23 16:40:02.376121",
        "updateTime": "2023-07-23 23:15:20.511847"
    },
    "xdm:2": {
        "id": "2",
        "title": "What is a Flowchart?",
        "content": "الكود الزائف هو مصطلح يستخدم غالبًا في البرمجة والحقول القائمة على الخوارزمية. إنها منهجية تسمح للمبرمج بتمثيل تنفيذ الخوارزمية. ببساطة ، يمكننا القول إنه تمثيل مطبوخ للخوارزمية. في كثير من الأحيان ، يتم تمثيل الخوارزميات بمساعدة الأكواد الزائفة حيث يمكن تفسيرها من قبل المبرمجين بغض النظر عن الخلفية أو المعرفة البرمجية الخاصة بهم. الكود الزائف ، كما يوحي الاسم ، هو رمز خاطئ أو تمثيل لرمز يمكن فهمه حتى من قبل شخص عادي لديه بعض المعرفة البرمجية على مستوى المدرسة. الخوارزمية: إنها تسلسل منطقي منظم للإجراءات أو النهج تجاه مشكلة معينة. يقوم المبرمج بتنفيذ خوارزمية لحل مشكلة. يتم التعبير عن الخوارزميات باستخدام التعليقات التوضيحية اللفظية الطبيعية ولكن الفنية إلى حد ما. الشفرة الزائفة: إنها ببساطة تنفيذ خوارزمية في شكل تعليقات توضيحية ونص إعلامي مكتوب بلغة إنجليزية بسيطة. لا تحتوي على صيغة مثل أي لغة برمجة وبالتالي لا يمكن تجميعها أو تفسيرها بواسطة الكمبيوتر.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-23 19:30:27.054425",
        "updateTime": "2023-07-24 05:38:53.089982"
    },
    "xdm:3": {
        "id": "3",
        "title": "Pseudo code",
        "content": "الكود الزائف هو مصطلح يستخدم غالبًا في البرمجة والحقول القائمة على الخوارزمية. إنها منهجية تسمح للمبرمج بتمثيل تنفيذ الخوارزمية. ببساطة ، يمكننا القول إنه تمثيل مطبوخ للخوارزمية. في كثير من الأحيان ، يتم تمثيل الخوارزميات بمساعدة الأكواد الزائفة حيث يمكن تفسيرها من قبل المبرمجين بغض النظر عن الخلفية أو المعرفة البرمجية الخاصة بهم. الكود الزائف ، كما يوحي الاسم ، هو رمز خاطئ أو تمثيل لرمز يمكن فهمه حتى من قبل شخص عادي لديه بعض المعرفة البرمجية على مستوى المدرسة. الخوارزمية: إنها تسلسل منطقي منظم للإجراءات أو النهج تجاه مشكلة معينة. يقوم المبرمج بتنفيذ خوارزمية لحل مشكلة. يتم التعبير عن الخوارزميات باستخدام التعليقات التوضيحية اللفظية الطبيعية ولكن الفنية إلى حد ما. الشفرة الزائفة: إنها ببساطة تنفيذ خوارزمية في شكل تعليقات توضيحية ونص إعلامي مكتوب بلغة إنجليزية بسيطة. لا تحتوي على صيغة مثل أي لغة برمجة وبالتالي لا يمكن تجميعها أو تفسيرها بواسطة الكمبيوتر.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-23 23:17:35.821543",
        "updateTime": "2023-07-23 23:18:02.127765"
    },
    "xdm:6": {
        "id": "6",
        "title": "Pseudo code for this algorithm",
        "content": "\nكيف نكتب خوارزمية تصنيف الفقاعة باستخدام الكود المزيف.\nSet n to number of records to be sorted\nانشاء متغير باسم n وتهيئته بعدد القيم المطلوب تصنيفها.\nrepeat\nتكرار\nflag = false;\nاشعار التوقف = توقف\nfor counter = 1 to n-1 do\nعمل حلقة For التكرارية وبمتغير داخلها باسم counter وبقيمة متغيرة من 1 حتى n-1 افعل (بمعنى انشاء حلقة تكرارية بعدد العناصر في المجموعة, n-1 هنا لان الحاسب سوف يبدا من الرقم 0 في العد, ولكن ما تزال مجموع العناصر في الستة n عنصر).\nif key[counter] > key[counter+1] then\nاذا كان العداد او المتغير counter قيمته اكبر من قيمته الحالية + 1 فقم بالتالي:\nswap the records;\nتبديل العناصر في المجموعة او اللستة.\nset flag = true;\nاشعار التوقف = يعمل\nend if\nنهاية الدالة If الشرطية\nend do\nنهاية الدال do التكرارية\nn = n-1;\nعدد عناصر المجموعة = عدد العناصر - 1\nuntil flag = false or n=1\nتكرار حتى يصب المتغير flag يساوي توقف او n = 1 عدد العناصر يساوي 1",
        "author": "249128430708@c.us",
        "createTime": "2023-07-24 06:00:54.089557",
        "updateTime": "2023-07-24 06:19:17.890018"
    },
    "xdm:10": {
        "id": "10",
        "title": "Git",
        "content": "Git هو نظام تحكم في الإصدار الموزع يتتبع التغييرات في أي مجموعة من ملفات الكمبيوتر ، وعادة ما يستخدم لتنسيق العمل بين المبرمجين بشكل تعاوني لتطوير التعليمات البرمجية المصدر أثناء تطوير البرامج. تتضمن أهدافه السرعة وتكامل البيانات ودعم تدفقات العمل الموزعة وغير الخطية.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-24 21:24:49.147900",
        "updateTime": "2023-07-24 21:25:19.594377"
    },
    "xdm:11": {
        "id": "11",
        "title": "Github",
        "content": "GitHub، Inc. هي عبارة عن نظام أساسي وخدمة قائمة على السحابة لتطوير البرامج والتحكم في الإصدار باستخدام Git ، مما يسمح للمطورين بتخزين التعليمات البرمجية الخاصة بهم وإدارتها. يوفر التحكم في الإصدار الموزع لـ Git plus التحكم في الوصول ، وتتبع الأخطاء ، وطلبات ميزات البرامج ، وإدارة المهام ، والتكامل المستمر",
        "author": "249128430708@c.us",
        "createTime": "2023-07-24 21:32:52.260229",
        "updateTime": "2023-07-24 21:33:06.453220"
    },
    "xdm:12": {
        "id": "12",
        "title": "Emacs",
        "content": "اسألة واجابات عمومية عن ال emacs\nما هو ال emacs؟\nهو باختصار كدة Text Editor او محرر نصوص بنستخدمو في الكتابة على الملفات.\nمن هو Richard Stallman؟\nريتشارد ماثيو ستالمان ‏، يختصر اسمه عادة بـ rms، هو مبرمج وعالم حاسوب وثوري أمريكي في مجال حرية البرمجيات في سبتمبر 1983، أطلق مشروع جنو لإنشاء نظام تشغيل شبيه بيونكس لكنه نظام حر، وكان يشغل منصب المنظم وكبير مهندسي المشروع. ويكيبيديا.\nكيف تفتح الملفات في برنامج ال emacs؟\nيمكن فتح الملفات في برنامج ال emacs من خلال الامر\n\nما هي ال buffer وكيف تنتقل من واحدة الى الاخرى?\n\nكيفية قص ولصق الاسطر والمناطق؟\nاولا عليك تحريك المؤشر بالاسهم الى بداية السطر الذي تريد قصه, ثم اضغض على Ctrl + k, من اجل قص السطر من مكان المؤشر, ومن اجل لصق السطر عليك بالاختصار C-y.\n\nكيفية استدعاء الاوامر من خلال الاسم؟\n\nكيف تبحث الى الامام والى الخلف؟\nتبدأ كتابة C-s متبوعة ببعض النص في البحث المتزايد. ينتقل Emacs إلى التكرار التالي لكل ما كتبته ، أثناء كتابته (ربما رأيت سلوكًا مشابهًا في Mozilla Firefox أو متصفحات الويب الأخرى) ، ويتم تمييز جميع التطابقات المرئية على شاشتك.\n\nكيفية الرجوع خطوة الى الوراء؟\nاذا كنت قد اخطأت في كتابة شيء ما, وتريد الرجوع خطوة الى الوراء عليك باستخدام الامر C-/.\n\nكيفية الغاء الاوامر النصف مدخلة؟\nقم بادخال الامر C-x u\tلالغاء وضع الاستجابة للاوامر.\n\nكيف تخرج من برنامج Emacs؟\nللخروج من برنامج ال emacs عليك بالاختصار C-c C-x ثم اضافة احدى طرق الخروج النهائي مثل الخروج والحفظ \".\" او الخروج من غير حفظ \"q\".",
        "author": "249128430708@c.us",
        "createTime": "2023-07-25 23:24:30.682697",
        "updateTime": "2023-07-25 23:24:52.329645"
    },
    "mopilani:13": {
        "id": "13",
        "title": "Git",
        "content": "ما هو الكود المصدري؟\nفعليا هو الملفات التي نكتب عليها الاوامر البرمجية او الاسطر البرمجية لبرنامج ما وهي تعتبر الشفرة المصدرية للبرنامج الهنائي.\n\nما هي إدارة الكود المصدري؟\nإدارة الشيفرة المصدرية، وهي نظم مسؤولة عن إدارة التغييرات في المستندات وبرامج الكمبيوتر ومواقع الويب الكبيرة ومجموعات أخرى من المعلومات قيد التطوير. عادة ما يتم تحديد التغييرات برقم أو حرف رمزي، يطلق عليه «رقم المراجعة» أو «مستوى المراجعة» أو ببساطة «مراجعة». ويكيبيديا.\n\nما هو ال Git؟\nهو اداة تحكم وربط بين جهازك ومستودع بيانات يحوي الكود المصدري.\n\nما هو Github؟\nهو اكبر موقع الكتروني لادارة مستودعات الكود المصدري.\n\nما هو الفرق بين Git و Github؟\nالفرق يكون في ان احداهما اداة للربط بين جهازك والاخر وهو المستودع.\n\nكيف تنشئ مستودع كود مصدري؟\nيمنك بعد انشاء حساب على Github انشاء مستودع Repository ورفع الكود المصدري خصاتك.\n\nما هي ملفات ال READMEs؟\nتعتبر واجهة الكود المصدري خاصتك لكل شخص اخر يريد الاتطلاع على المكتبة ومعرفة وصفها ومعرفة طريقة التشغيل.\n\nما هي التأكيدات - commits؟\nهي تأكيدات لما تم فعله في الملفات او التعديلات التي اجريت في الوقت الحالي.\n\nكيف تدفع الكود الى المستودع؟\nنستخدم الامر git push لدفع او رفع الكود المصدري الى المستودع\n\nكيف تسحب الكود من المستودع؟\nيمكنك من خلال الامر git pull سحب التحديثات من المستودع.\n\nكيف تنشئ فرع للمستودع؟\nيمكنك انشاء فرع من المستودع كي تضيف عليه بعد التعديلات والحفاظ على نسخة في نفس الوقت من المستودع.\n\nكيف تدمج المستودعات؟\nيمكنك دمج المستوداعت بعد تقسيمها الى فروع.\n\nما هي الملفات التي يجب ان تظهر والملفات التي لا يجب ان تظهر؟\nهناك بعض الملفات مثلا الملفات التي يتم الاعتماد عليها وهي متوفرة على الانترنت, يمكن دفع المك",
        "author": "249901503116@c.us",
        "createTime": "2023-07-26 15:06:30.361306",
        "updateTime": "2023-07-26 15:09:03.442304"
    },
    "xdm:14": {
        "id": "14",
        "title": "Generating a new SSH key",
        "content": "1- افتح اي برنامج مثل Terminal, Gitbash, CMD, Powershell على جهازك الخاص اولا.\n2- اكتب هذا الامر بالطريقة التي تناسبك ssh-keygen -t ed25519 -C \"your_email@example.com\" فهذا الامر سيقوم بانشاء مفاتيح ال SSH الخاصة بجهازك.\n3- اذا كان نظامك لا يدعم خوارزمية ed25519 استخدم ssh-keygen -t rsa -b 4096 -C \"your_email@example.com\".\n4- يؤدي هذا إلى إنشاء مفتاح SSH جديد ، باستخدام البريد الإلكتروني المقدم كتسمية.\n5- عندما يُطلب منك \"إدخال ملف لحفظ المفتاح فيه\" ، يمكنك الضغط على Enter لقبول موقع الملف الافتراضي. يرجى ملاحظة أنه إذا قمت بإنشاء مفاتيح SSH مسبقًا ، فقد يطلب منك ssh-keygen إعادة كتابة مفتاح آخر ، وفي هذه الحالة نوصي بإنشاء مفتاح SSH باسم مخصص. للقيام بذلك ، اكتب موقع الملف الافتراضي واستبدل id_ssh_keyname باسم المفتاح المخصص الخاص بك.\n6- في موجه الأوامر ، اكتب عبارة مرور آمنة. لمزيد من المعلومات ، راجع \"التعامل مع عبارات مرور مفتاح SSH.\".",
        "author": "249128430708@c.us",
        "createTime": "2023-07-26 20:06:51.894145",
        "updateTime": "2023-07-26 21:03:35.652207"
    },
    "xdm:15": {
        "id": "15",
        "title": "10 نصائح لالتقاط صورة ملف شخصي احترافية على LinkedIn",
        "content": "\n1. اختر صورة تشبهك.\n2. استخدم صورة عالية الدقة.\n3. تأكد من أن وجهك يشغل 60٪ على الأقل من الإطار.\n4. كن الشخص الوحيد في الصورة.\n5. احصل على شخص آخر لالتقاط الصورة لك.\n6. التقط صورة بالتعبير الصحيح.\n7. تجنب الخلفيات المشتتة للانتباه.\n8. ارتدِ ما ترتديه في العمل.\n9. التقط الصورة في ضوء طبيعي ناعم.\n10. استخدم المرشحات بحكمة.\nيعني وجود صورة ملف شخصي رائعة على LinkedIn بالنسبة لك.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-26 20:49:15.119794",
        "updateTime": "2023-07-26 22:11:39.108704"
    },
    "xdm:16": {
        "id": "16",
        "title": "إدارة رموز الوصول الشخصية الخاصة بك",
        "content": "إدارة رموز الوصول الشخصية الخاصة بك\n\nرموز الوصول الشخصية الدقيقة\n\nتتميز رموز الوصول الشخصية الدقيقة بالعديد من مزايا الأمان على رموز الوصول الشخصية (الكلاسيكية):\n\nيمكن لكل رمز مميز الوصول إلى الموارد التي يمتلكها مستخدم أو مؤسسة واحدة فقط.\nيمكن لكل رمز مميز الوصول إلى مستودعات محددة فقط.\nيتم منح كل رمز مميز أذونات محددة ، والتي توفر تحكمًا أكبر من النطاقات الممنوحة لرموز الوصول الشخصية (الكلاسيكية).\nيجب أن يكون لكل رمز تاريخ انتهاء صلاحية.\nيمكن لمالكي المؤسسة طلب الموافقة على أي رموز وصول شخصية دقيقة يمكنها الوصول إلى الموارد في المؤسسة.\n\nرموز الوصول الشخصية (الكلاسيكية)\n\nرموز الوصول الشخصية (الكلاسيكية) أقل أمانًا. ومع ذلك ، ستعمل بعض الميزات حاليًا فقط مع رموز الوصول الشخصية (الكلاسيكية):\n\nفقط رموز الوصول الشخصية (الكلاسيكية) لها حق الوصول للكتابة للمستودعات العامة التي لا تملكها أنت أو مؤسسة لست عضوًا فيها.\nيمكن للمتعاونين الخارجيين فقط استخدام رموز الوصول الشخصية (الكلاسيكية) للوصول إلى مستودعات المؤسسة التي يتعاونون فيها.\nلا تتوفر بعض عمليات REST API لرموز الوصول الشخصية الدقيقة.",
        "author": "249128430708@c.us",
        "createTime": "2023-07-26 22:30:31.308836",
        "updateTime": "2023-07-26 22:37:51.287219"
    },
    "xdm:17": {
        "id": "17",
        "title": "إنشاء رمز وصول شخصي دقيق - Git Token",
        "content": "1- تحقق من عنوان بريدك الإلكتروني ، إذا لم يتم التحقق منه بعد.\n2- في الزاوية العلوية اليسرى من أي صفحة ، انقر على صورة ملفك الشخصي ، ثم انقر على الإعدادات.\n3- في الشريط الجانبي الأيسر ، انقر فوق إعدادات المطور.\n4- في الشريط الجانبي الأيمن ، ضمن رموز الوصول الشخصية ، انقر على الرموز المميزة ذات الحبيبات الدقيقة.\n5- انقر فوق إنشاء رمز مميز جديد.\n6- تحت اسم الرمز ، أدخل اسمًا للرمز.\n7- ضمن انتهاء الصلاحية ، حدد انتهاء صلاحية الرمز المميز.\n8- اختياريًا ، ضمن الوصف ، أضف ملاحظة لوصف الغرض من الرمز المميز.\n9- قادر على الوصول إلى الموارد التي يملكها مالك المورد المحدد. لن تظهر المؤسسات التي أنت عضو فيها ما لم تشترك المنظمة في رموز الوصول الشخصية الدقيقة. للمزيد من المعلومات.\n10- اختياريًا ، إذا كان مالك المورد مؤسسة تتطلب الموافقة على رموز الوصول الشخصية الدقيقة ، أسفل مالك المورد ، في المربع ، أدخل تبريرًا للطلب.\n11- ضمن الوصول إلى المستودع ، حدد المستودعات التي تريد أن يصل الرمز المميز إليها. يجب عليك اختيار الحد الأدنى من الوصول إلى المستودع الذي يلبي احتياجاتك. تشتمل الرموز دائمًا على وصول للقراءة فقط إلى جميع المستودعات العامة على GitHub.\n12- إذا قمت بتحديد المستودعات المحددة فقط في الخطوة السابقة ، ضمن القائمة المنسدلة للمستودعات المحددة ، حدد المستودعات التي تريد أن يصل الرمز المميز إليها.\n13- ضمن الأذونات ، حدد الأذونات لمنح الرمز المميز. بناءً على مالك المورد ووصول المستودع الذي حددته ، توجد أذونات المستودع والمؤسسة والحساب. يجب عليك اختيار الحد الأدنى من الأذونات اللازمة لاحتياجاتك. لمزيد من المعلومات حول الأذونات المطلوبة لكل عملية REST API.\n14- انقر فوق إنشاء رمز مميز.\n\nhttps://docs.github.com/en/authentication/keeping-your-account-and-data-secure/managing-your-personal-access-tokens",
        "author": "249128430708@c.us",
        "createTime": "2023-07-26 22:39:48.542648",
        "updateTime": "2023-07-26 22:55:22.060526"
    },
    "xdm:18": {
        "id": "18",
        "title": "Git commands",
        "content": "git check out <Branch Name Here> - Switch to a specific branch\n\ngit branch <New Branch Name> - Create new branch\n\ngit branch - View the current selected branch\n\ngit add . - add all the files in the directory under the tracking\n\ngit commit -m \"Message for others\" - Make a commit for you changes to make others know about it.\n\ngit push - push your commits to the repo\n\ngit global user.email \"example@email.com\" - Change your local email\n\ngit global user.name \"Your Name\" - Change your local name",
        "author": "249128430708@c.us",
        "createTime": "2023-07-27 01:16:16.900418",
        "updateTime": "2023-07-27 01:16:28.042796"
    }
}